In [34]:
import pandas as pd
import numpy as np

# Erstellen Sie eine Liste mit fortlaufenden Nummern von 1-5. Fügen Sie dieser Liste eine weitere Nummer hinzu. Lassen Sie sich min, mean und max ausgeben (Tipp: Muss vorher konvertiert werden)

In [35]:
new_list = [1,2,3,4,5]

In [36]:
new_list.append(6)

In [37]:
new_list

[1, 2, 3, 4, 5, 6]

In [38]:
print(min(new_list))

1

In [39]:
print(max(new_list))

6

In [40]:
print(np.mean(new_list))

3.5

# Erstellen Sie nun ebenfalls eine Liste mit Namen von Früchten. Die Liste sollte die gleiche Länge haben wie Ihre vorherige Liste.

In [41]:
fruits = ["elma","kiraz","portakal","muz","cilek","visne"]

In [42]:
len(fruits)

6

# Weisen Sie die Liste einem Dictionary mit dem Namen Fruits zu.

In [43]:

fruitdict={
    "fruitid" : new_list,
    "fruitnames" : fruits
}

# Erstellen Sie aus dem Dictionary ein pandas-DataFrame und lassen Sie sich die ersten zwei Zeilen mit dem .head()-Befehl ausgeben.

In [44]:
df = pd.DataFrame(fruitdict)

In [45]:
df.head(2)

   fruitid fruitnames
0        1       elma
1        2      kiraz

# Fügen Sie das unten stehende Dictionary zu Ihrem Dataframe hinzu

In [46]:
newid=[7]
newname=["pineapple"]

In [47]:
fruits2 = {
    "fruitid" : newid,
    "fruitnames" : newname
}

In [48]:
df2 = pd.DataFrame(fruits2)

In [49]:
df = pd.concat([df2,df],ignore_index = False)

In [50]:
df

   fruitid fruitnames
0        7  pineapple
0        1       elma
1        2      kiraz
2        3   portakal
3        4        muz
4        5      cilek
5        6      visne

# Geben Sie die zweite und dritte Zeile mit dem .iloc()-Befehl aus.

In [51]:
df.iloc[1:3]

   fruitid fruitnames
0        1       elma
1        2      kiraz

# Fügen Sie eine weiter Spalte mit der Bezeichnung "Kategorie" zu dem DataFrame hinzu und vergeben Sie für alle bisherigen Zeilen eine passende Kategorie.

In [52]:
df["Kategorie"] = "Obst"

In [53]:
df

   fruitid fruitnames Kategorie
0        7  pineapple      Obst
0        1       elma      Obst
1        2      kiraz      Obst
2        3   portakal      Obst
3        4        muz      Obst
4        5      cilek      Obst
5        6      visne      Obst

# Überprüfen Sie Ihre Eingabe, indem Sie sich mit dem .loc()-Befehl die Spalte Kategorie für alle Zeilen ausgeben lassen

In [56]:
df.loc[:,["Kategorie"]]

  Kategorie
0      Obst
0      Obst
1      Obst
2      Obst
3      Obst
4      Obst
5      Obst

# Wandeln Sie abschließend alle strings von Früchten in Großbustaben um. Benutzen Sie hierfür eine in Python-implementierte Funktion

In [59]:
df.fruitnames = df.fruitnames.apply(lambda x:x.upper())

In [60]:
df

   fruitid fruitnames Kategorie
0        7  PINEAPPLE      Obst
0        1       ELMA      Obst
1        2      KIRAZ      Obst
2        3   PORTAKAL      Obst
3        4        MUZ      Obst
4        5      CILEK      Obst
5        6      VISNE      Obst